/**
 * JS Document for xxxx
 * developer:wen
 * 城市联级菜单
 * <div id="citybox"><select class="prov"></select></div>
 * $("#citybox").wen_plug_cityLinkage({});
 */
var city = [{"name":"北京","id":"1","sub":[{"name":"东城区","id":"37"},{"name":"西城区","id":"38"},{"name":"崇文区","id":"39"},{"name":"宣武区","id":"40"},{"name":"朝阳区","id":"41"},{"name":"海淀区","id":"42"},{"name":"丰台区","id":"43"},{"name":"石景山区","id":"44"},{"name":"房山区","id":"45"},{"name":"通州区","id":"46"},{"name":"顺义区","id":"47"},{"name":"昌平区","id":"48"},{"name":"大兴区","id":"49"},{"name":"怀柔区","id":"50"},{"name":"平谷区","id":"51"},{"name":"门头沟区","id":"52"},{"name":"密云县","id":"53"},{"name":"延庆县","id":"54"}]},{"name":"广东","id":"2","sub":[{"name":"广州","id":"56"},{"name":"深圳","id":"57"},{"name":"珠海","id":"58"},{"name":"汕头","id":"59"},{"name":"韶关","id":"60"},{"name":"佛山","id":"61"},{"name":"江门","id":"62"},{"name":"湛江","id":"63"},{"name":"茂名","id":"64"},{"name":"肇庆","id":"65"},{"name":"惠州","id":"66"},{"name":"梅州","id":"67"},{"name":"汕尾","id":"68"},{"name":"河源","id":"69"},{"name":"阳江","id":"70"},{"name":"清远","id":"71"},{"name":"东莞","id":"72"},{"name":"中山","id":"73"},{"name":"潮州","id":"74"},{"name":"揭阳","id":"75"},{"name":"云浮","id":"76"}]},{"name":"上海","id":"3","sub":[{"name":"黄浦区","id":"78"},{"name":"卢湾区","id":"79"},{"name":"徐汇区","id":"80"},{"name":"长宁区","id":"81"},{"name":"静安区","id":"82"},{"name":"普陀区","id":"83"},{"name":"闸北区","id":"84"},{"name":"虹口区","id":"85"},{"name":"杨浦区","id":"86"},{"name":"宝山区","id":"87"},{"name":"闵行区","id":"88"},{"name":"嘉定区","id":"89"},{"name":"松江区","id":"90"},{"name":"金山区","id":"91"},{"name":"青浦区","id":"92"},{"name":"南汇区","id":"93"},{"name":"奉贤区","id":"94"},{"name":"浦东新区","id":"95"},{"name":"崇明县","id":"96"}]},{"name":"天津","id":"4","sub":[{"name":"和平区","id":"98"},{"name":"河东区","id":"99"},{"name":"河西区","id":"100"},{"name":"南开区","id":"101"},{"name":"河北区","id":"102"},{"name":"红桥区","id":"103"},{"name":"塘沽区","id":"104"},{"name":"汉沽区","id":"105"},{"name":"大港区","id":"106"},{"name":"东丽区","id":"107"},{"name":"西青区","id":"108"},{"name":"北辰区","id":"109"},{"name":"津南区","id":"110"},{"name":"武清区","id":"111"},{"name":"宝坻区","id":"112"},{"name":"静海县","id":"113"},{"name":"宁河县","id":"114"},{"name":"蓟县","id":"115"}]},{"name":"重庆","id":"5","sub":[{"name":"渝中区","id":"117"},{"name":"大渡口区","id":"118"},{"name":"江北区","id":"119"},{"name":"南岸区","id":"120"},{"name":"北碚区","id":"121"},{"name":"渝北区","id":"122"},{"name":"巴南区","id":"123"},{"name":"长寿区","id":"124"},{"name":"双桥区","id":"125"},{"name":"沙坪坝区","id":"126"},{"name":"万盛区","id":"127"},{"name":"万州区","id":"128"},{"name":"涪陵区","id":"129"},{"name":"黔江区","id":"130"},{"name":"永川区","id":"131"},{"name":"合川区","id":"132"},{"name":"江津区","id":"133"},{"name":"九龙坡区","id":"134"},{"name":"南川区","id":"135"},{"name":"綦江县","id":"136"},{"name":"潼南县","id":"137"},{"name":"荣昌县","id":"138"},{"name":"璧山县","id":"139"},{"name":"大足县","id":"140"},{"name":"铜梁县","id":"141"},{"name":"梁平县","id":"142"},{"name":"开县","id":"143"},{"name":"忠县","id":"144"},{"name":"城口县","id":"145"},{"name":"垫江县","id":"146"},{"name":"武隆县","id":"147"},{"name":"丰都县","id":"148"},{"name":"奉节县","id":"149"},{"name":"云阳县","id":"150"},{"name":"巫溪县","id":"151"},{"name":"巫山县","id":"152"},{"name":"石柱土家族自治县","id":"153"},{"name":"秀山土家族苗族自治县","id":"154"},{"name":"酉阳土家族苗族自治县","id":"155"},{"name":"彭水苗族土家族自治县","id":"156"}]},{"name":"辽宁","id":"6","sub":[{"name":"沈阳","id":"158"},{"name":"大连","id":"159"},{"name":"鞍山","id":"160"},{"name":"抚顺","id":"161"},{"name":"本溪","id":"162"},{"name":"丹东","id":"163"},{"name":"锦州","id":"164"},{"name":"营口","id":"165"},{"name":"阜新","id":"166"},{"name":"辽阳","id":"167"},{"name":"盘锦","id":"168"},{"name":"铁岭","id":"169"},{"name":"朝阳","id":"170"},{"name":"葫芦岛","id":"171"}]},{"name":"江苏","id":"7","sub":[{"name":"南京","id":"173"},{"name":"苏州","id":"174"},{"name":"无锡","id":"175"},{"name":"常州","id":"176"},{"name":"镇江","id":"177"},{"name":"南通","id":"178"},{"name":"泰州","id":"179"},{"name":"扬州","id":"180"},{"name":"盐城","id":"181"},{"name":"连云港","id":"182"},{"name":"徐州","id":"183"},{"name":"淮安","id":"184"},{"name":"宿迁","id":"185"}]},{"name":"湖北","id":"8","sub":[{"name":"武汉","id":"187"},{"name":"黄石","id":"188"},{"name":"十堰","id":"189"},{"name":"荆州","id":"190"},{"name":"宜昌","id":"191"},{"name":"襄樊","id":"192"},{"name":"鄂州","id":"193"},{"name":"荆门","id":"194"},{"name":"孝感","id":"195"},{"name":"黄冈","id":"196"},{"name":"咸宁","id":"197"},{"name":"随州","id":"198"},{"name":"恩施土家族苗族自治州","id":"199"},{"name":"仙桃","id":"200"},{"name":"天门","id":"201"},{"name":"潜江","id":"202"},{"name":"神农架林区","id":"203"}]},{"name":"四川","id":"9","sub":[{"name":"成都","id":"205"},{"name":"自贡","id":"206"},{"name":"攀枝花","id":"207"},{"name":"泸州","id":"208"},{"name":"德阳","id":"209"},{"name":"绵阳","id":"210"},{"name":"广元","id":"211"},{"name":"遂宁","id":"212"},{"name":"内江","id":"213"},{"name":"乐山","id":"214"},{"name":"南充","id":"215"},{"name":"眉山","id":"216"},{"name":"宜宾","id":"217"},{"name":"广安","id":"218"},{"name":"达州","id":"219"},{"name":"雅安","id":"220"},{"name":"巴中","id":"221"},{"name":"资阳","id":"222"},{"name":"阿坝藏族羌族自治州","id":"223"},{"name":"甘孜藏族自治州","id":"224"},{"name":"凉山彝族自治州","id":"225"}]},{"name":"陕西","id":"10","sub":[{"name":"西安","id":"227"},{"name":"铜川","id":"228"},{"name":"宝鸡","id":"229"},{"name":"咸阳","id":"230"},{"name":"渭南","id":"231"},{"name":"延安","id":"232"},{"name":"汉中","id":"233"},{"name":"榆林","id":"234"},{"name":"安康","id":"235"},{"name":"商洛","id":"236"}]},{"name":"河北","id":"11","sub":[{"name":"石家庄","id":"238"},{"name":"唐山","id":"239"},{"name":"秦皇岛","id":"240"},{"name":"邯郸","id":"241"},{"name":"邢台","id":"242"},{"name":"保定","id":"243"},{"name":"张家口","id":"244"},{"name":"承德","id":"245"},{"name":"沧州","id":"246"},{"name":"廊坊","id":"247"},{"name":"衡水","id":"248"}]},{"name":"山西","id":"12","sub":[{"name":"太原","id":"250"},{"name":"大同","id":"251"},{"name":"阳泉","id":"252"},{"name":"长治","id":"253"},{"name":"晋城","id":"254"},{"name":"朔州","id":"255"},{"name":"晋中","id":"256"},{"name":"运城","id":"257"},{"name":"忻州","id":"258"},{"name":"临汾","id":"259"},{"name":"吕梁","id":"260"}]},{"name":"河南","id":"13","sub":[{"name":"郑州","id":"262"},{"name":"开封","id":"263"},{"name":"洛阳","id":"264"},{"name":"平顶山","id":"265"},{"name":"安阳","id":"266"},{"name":"鹤壁","id":"267"},{"name":"新乡","id":"268"},{"name":"焦作","id":"269"},{"name":"濮阳","id":"270"},{"name":"许昌","id":"271"},{"name":"漯河","id":"272"},{"name":"三门峡","id":"273"},{"name":"南阳","id":"274"},{"name":"商丘","id":"275"},{"name":"信阳","id":"276"},{"name":"周口","id":"277"},{"name":"驻马店","id":"278"},{"name":"焦作","id":"279"}]},{"name":"吉林","id":"14","sub":[{"name":"长春","id":"281"},{"name":"吉林","id":"282"},{"name":"四平","id":"283"},{"name":"辽源","id":"284"},{"name":"通化","id":"285"},{"name":"白山","id":"286"},{"name":"松原","id":"287"},{"name":"白城","id":"288"},{"name":"延边朝鲜族自治州","id":"289"}]},{"name":"黑龙江","id":"15","sub":[{"name":"哈尔滨","id":"291"},{"name":"齐齐哈尔","id":"292"},{"name":"鹤岗","id":"293"},{"name":"双鸭山","id":"294"},{"name":"鸡西","id":"295"},{"name":"大庆","id":"296"},{"name":"伊春","id":"297"},{"name":"牡丹江","id":"298"},{"name":"佳木斯","id":"299"},{"name":"七台河","id":"300"},{"name":"黑河","id":"301"},{"name":"绥化","id":"302"},{"name":"大兴安岭地区","id":"303"}]},{"name":"内蒙古","id":"16","sub":[{"name":"呼和浩特","id":"305"},{"name":"包头","id":"306"},{"name":"乌海","id":"307"},{"name":"赤峰","id":"308"},{"name":"通辽","id":"309"},{"name":"鄂尔多斯","id":"310"},{"name":"呼伦贝尔","id":"311"},{"name":"巴彦淖尔","id":"312"},{"name":"乌兰察布","id":"313"},{"name":"锡林郭勒盟","id":"314"},{"name":"兴安盟","id":"315"},{"name":"阿拉善盟","id":"316"}]},{"name":"山东","id":"17","sub":[{"name":"济南","id":"318"},{"name":"青岛","id":"319"},{"name":"淄博","id":"320"},{"name":"枣庄","id":"321"},{"name":"东营","id":"322"},{"name":"烟台","id":"323"},{"name":"潍坊","id":"324"},{"name":"济宁","id":"325"},{"name":"泰安","id":"326"},{"name":"威海","id":"327"},{"name":"日照","id":"328"},{"name":"莱芜","id":"329"},{"name":"临沂","id":"330"},{"name":"德州","id":"331"},{"name":"聊城","id":"332"},{"name":"滨州","id":"333"},{"name":"菏泽","id":"334"}]},{"name":"安徽","id":"18","sub":[{"name":"合肥","id":"336"},{"name":"芜湖","id":"337"},{"name":"蚌埠","id":"338"},{"name":"淮南","id":"339"},{"name":"马鞍山","id":"340"},{"name":"淮北","id":"341"},{"name":"铜陵","id":"342"},{"name":"安庆","id":"343"},{"name":"黄山","id":"344"},{"name":"滁州","id":"345"},{"name":"阜阳","id":"346"},{"name":"宿州","id":"347"},{"name":"巢湖","id":"348"},{"name":"六安","id":"349"},{"name":"亳州","id":"350"},{"name":"池州","id":"351"},{"name":"宣城","id":"352"}]},{"name":"浙江","id":"19","sub":[{"name":"杭州","id":"354"},{"name":"宁波","id":"355"},{"name":"温州","id":"356"},{"name":"嘉兴","id":"357"},{"name":"湖州","id":"358"},{"name":"绍兴","id":"359"},{"name":"金华","id":"360"},{"name":"衢州","id":"361"},{"name":"舟山","id":"362"},{"name":"台州","id":"363"},{"name":"丽水","id":"364"}]},{"name":"福建","id":"20","sub":[{"name":"福州","id":"366"},{"name":"厦门","id":"367"},{"name":"莆田","id":"368"},{"name":"三明","id":"369"},{"name":"泉州","id":"370"},{"name":"漳州","id":"371"},{"name":"南平","id":"372"},{"name":"龙岩","id":"373"},{"name":"宁德","id":"374"}]},{"name":"湖南","id":"21","sub":[{"name":"长沙","id":"376"},{"name":"株洲","id":"377"},{"name":"湘潭","id":"378"},{"name":"衡阳","id":"379"},{"name":"邵阳","id":"380"},{"name":"岳阳","id":"381"},{"name":"常德","id":"382"},{"name":"张家界","id":"383"},{"name":"益阳","id":"384"},{"name":"郴州","id":"385"},{"name":"永州","id":"386"},{"name":"怀化","id":"387"},{"name":"娄底","id":"388"},{"name":"湘西土家族苗族自治州","id":"389"}]},{"name":"广西","id":"22","sub":[{"name":"南宁","id":"391"},{"name":"柳州","id":"392"},{"name":"桂林","id":"393"},{"name":"梧州","id":"394"},{"name":"北海","id":"395"},{"name":"防城港","id":"396"},{"name":"钦州","id":"397"},{"name":"贵港","id":"398"},{"name":"玉林","id":"399"},{"name":"百色","id":"400"},{"name":"贺州","id":"401"},{"name":"河池","id":"402"},{"name":"来宾","id":"403"},{"name":"崇左","id":"404"}]},{"name":"江西","id":"23","sub":[{"name":"南昌","id":"406"},{"name":"景德镇","id":"407"},{"name":"萍乡","id":"408"},{"name":"九江","id":"409"},{"name":"新余","id":"410"},{"name":"鹰潭","id":"411"},{"name":"赣州","id":"412"},{"name":"吉安","id":"413"},{"name":"宜春","id":"414"},{"name":"抚州","id":"415"},{"name":"上饶","id":"416"}]},{"name":"贵州","id":"24","sub":[{"name":"贵阳","id":"418"},{"name":"六盘水","id":"419"},{"name":"遵义","id":"420"},{"name":"安顺","id":"421"},{"name":"铜仁地区","id":"422"},{"name":"毕节地区","id":"423"},{"name":"黔西南布依族苗族自治州","id":"424"},{"name":"黔东南苗族侗族自治州","id":"425"},{"name":"黔南布依族苗族自治州","id":"426"}]},{"name":"云南","id":"25","sub":[{"name":"昆明","id":"428"},{"name":"曲靖","id":"429"},{"name":"玉溪","id":"430"},{"name":"保山","id":"431"},{"name":"昭通","id":"432"},{"name":"丽江","id":"433"},{"name":"普洱","id":"434"},{"name":"临沧","id":"435"},{"name":"德宏傣族景颇族自治州","id":"436"},{"name":"怒江傈僳族自治州","id":"437"},{"name":"迪庆藏族自治州","id":"438"},{"name":"大理白族自治州","id":"439"},{"name":"楚雄彝族自治州","id":"440"},{"name":"红河哈尼族彝族自治州","id":"441"},{"name":"文山壮族苗族自治州","id":"442"},{"name":"西双版纳傣族自治州","id":"443"}]},{"name":"西藏","id":"26","sub":[{"name":"拉萨","id":"445"},{"name":"那曲地区","id":"446"},{"name":"昌都地区","id":"447"},{"name":"林芝地区","id":"448"},{"name":"山南地区","id":"449"},{"name":"日喀则地区","id":"450"},{"name":"阿里地区","id":"451"}]},{"name":"海南","id":"27","sub":[{"name":"海口","id":"453"},{"name":"三亚","id":"454"},{"name":"五指山","id":"455"},{"name":"琼海","id":"456"},{"name":"儋州","id":"457"},{"name":"文昌","id":"458"},{"name":"万宁","id":"459"},{"name":"东方","id":"460"},{"name":"澄迈县","id":"461"},{"name":"定安县","id":"462"},{"name":"屯昌县","id":"463"},{"name":"临高县","id":"464"},{"name":"白沙黎族自治县","id":"465"},{"name":"昌江黎族自治县","id":"466"},{"name":"乐东黎族自治县","id":"467"},{"name":"陵水黎族自治县","id":"468"},{"name":"保亭黎族苗族自治县","id":"469"},{"name":"琼中黎族苗族自治县","id":"470"}]},{"name":"甘肃","id":"28","sub":[{"name":"兰州","id":"472"},{"name":"嘉峪关","id":"473"},{"name":"金昌","id":"474"},{"name":"白银","id":"475"},{"name":"天水","id":"476"},{"name":"武威","id":"477"},{"name":"酒泉","id":"478"},{"name":"张掖","id":"479"},{"name":"庆阳","id":"480"},{"name":"平凉","id":"481"},{"name":"定西","id":"482"},{"name":"陇南","id":"483"},{"name":"临夏回族自治州","id":"484"},{"name":"甘南藏族自治州","id":"485"}]},{"name":"宁夏","id":"29","sub":[{"name":"银川","id":"487"},{"name":"石嘴山","id":"488"},{"name":"吴忠","id":"489"},{"name":"固原","id":"490"},{"name":"中卫","id":"491"}]},{"name":"青海","id":"30","sub":[{"name":"西宁","id":"493"},{"name":"海东地区","id":"494"},{"name":"海北藏族自治州","id":"495"},{"name":"海南藏族自治州","id":"496"},{"name":"黄南藏族自治州","id":"497"},{"name":"果洛藏族自治州","id":"498"},{"name":"玉树藏族自治州","id":"499"},{"name":"海西蒙古族藏族自治州","id":"500"}]},{"name":"新疆","id":"31","sub":[{"name":"乌鲁木齐","id":"502"},{"name":"克拉玛依","id":"503"},{"name":"吐鲁番地区","id":"504"},{"name":"哈密地区","id":"505"},{"name":"和田地区","id":"506"},{"name":"阿克苏地区","id":"507"},{"name":"喀什地区","id":"508"},{"name":"克孜勒苏柯尔克孜自治州","id":"509"},{"name":"巴音郭楞蒙古自治州","id":"510"},{"name":"昌吉回族自治州","id":"511"},{"name":"博尔塔拉蒙古自治州","id":"512"},{"name":"石河子","id":"513"},{"name":"阿拉尔","id":"514"},{"name":"图木舒克","id":"515"},{"name":"五家渠","id":"516"},{"name":"伊犁哈萨克自治州","id":"517"}]},{"name":"香港","id":"32","sub":[{"name":"中西区","id":"519"},{"name":"湾仔区","id":"520"},{"name":"东区","id":"521"},{"name":"南区","id":"522"},{"name":"深水埗区","id":"523"},{"name":"油尖旺区","id":"524"},{"name":"九龙城区","id":"525"},{"name":"黄大仙区","id":"526"},{"name":"观塘区","id":"527"},{"name":"北区","id":"528"},{"name":"大埔区","id":"529"},{"name":"沙田区","id":"530"},{"name":"西贡区","id":"531"},{"name":"元朗区","id":"532"},{"name":"屯门区","id":"533"},{"name":"荃湾区","id":"534"},{"name":"葵青区","id":"535"},{"name":"离岛区","id":"536"}]},{"name":"澳门","id":"33","sub":[{"name":"花地玛堂区","id":"538"},{"name":"圣安多尼堂区","id":"539"},{"name":"大堂区","id":"540"},{"name":"望德堂区","id":"541"},{"name":"风顺堂区","id":"542"},{"name":"嘉模堂区","id":"543"},{"name":"圣方济各堂区","id":"544"},{"name":"路凼","id":"545"}]},{"name":"台湾","id":"34","sub":[{"name":"台北市","id":"547"},{"name":"高雄市","id":"548"},{"name":"台北县","id":"549"},{"name":"桃园县","id":"550"},{"name":"新竹县","id":"551"},{"name":"苗栗县","id":"552"},{"name":"台中县","id":"553"},{"name":"彰化县","id":"554"},{"name":"南投县","id":"555"},{"name":"云林县","id":"556"},{"name":"嘉义县","id":"557"},{"name":"台南县","id":"558"},{"name":"高雄县","id":"559"},{"name":"屏东县","id":"560"},{"name":"宜兰县","id":"561"},{"name":"花莲县","id":"562"},{"name":"台东县","id":"563"},{"name":"澎湖县","id":"564"},{"name":"基隆市","id":"565"},{"name":"新竹市","id":"566"},{"name":"台中市","id":"567"},{"name":"嘉义市","id":"568"},{"name":"台南市","id":"569"}]},{"name":"海外","id":"35"}];

(function($){
    $.fn.wen_plug_cityLinkage = function(options) {
        if(this.length<1){return;}

        // 默认值
        options = $.extend({
			elem:".prov",//默认下拉框
            url:city,	//联级菜单对象或ajax地址,
            prov:"",	//省
            city:"",	//市
            dist:"",	//县
            sele:true,	//true? "<option value=''>请选择</option>" : "";
            fun:""		//回调
        },options);

        return this.each(function() {
            var box_obj = $(this);
            var prov_obj = box_obj.find(options.elem).first();
            var select_prehtml = (options.sele) ? "<option value=''>请选择</option>" : "";
            var city_json;

            // 赋值市级函数
            var cityStart = function (elem, data) {
                var prov_id = elem.get(0).selectedIndex;
                if (options.sele) {
                    prov_id--;
                }
                elem.nextAll().remove();

                if (prov_id < 0 || !data[prov_id].sub || data[prov_id].sub.length < 1) {
                    return;
                }

                var copyN = elem.clone(false, false);
                copyN.empty().insertAfter(elem);
                // 遍历赋值市级下拉列表
                temp_html = select_prehtml;
                $.each(data[prov_id].sub, function (i, city) {
                    temp_html += "<option value='" + city.id + "'>" + city.name + "</option>";
                });
                elem.next().html(temp_html).change(function () {
                    cityStart($(this), data[prov_id].sub);
                    if (typeof options.fun == "function") {
                        options.fun($(this));
                    }
                });
            };

            var init = function () {
                // 遍历赋值省份下拉列表
                temp_html = select_prehtml;
                $.each(city_json, function (i, prov) {
                    temp_html += "<option value='" + prov.id + "'>" + prov.name + "</option>";
                });
                prov_obj.html(temp_html);

                // 若有传入省份与市级的值，则选中。（setTimeout为兼容IE6而设置）
                setTimeout(function () {
                    if (!!options.prov) {
                        prov_obj.val(options.prov).trigger("change");
                        setTimeout(function () {
                            if (!!options.city) {
                                box_obj.find(options.elem).last().val(options.city).trigger("change");
                                setTimeout(function () {
                                    if (!!options.dist) {
                                        box_obj.find(options.elem).last().val(options.dist).trigger("change");
                                    }
                                }, 1);
                            }
                        }, 1);
                    }
                }, 1);

                // 选择省份时发生事件
                prov_obj.bind("change", function () {
                    cityStart($(this), city_json);
                    if (typeof options.fun == "function") {
                        options.fun($(this));
                    }
                });
            };

            // 设置省市json数据
            if (typeof(options.url) == "string") {
                $.getJSON(options.url, function (json) {
                    city_json = json;
                    init();
                });
            } else {
                city_json = options.url;
                init();
            }
        })
    }
})(jQuery);